reyessanchezo/EENG340/Lab_3_motors/PSOC_Creator/JoystickDCMotor/DCMotor.cydsn/Generated_Source/PSoC5/DriverControlReg.h
/*******************************************************************************
* File Name: DriverControlReg.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_DriverControlReg_H) /* CY_CONTROL_REG_DriverControlReg_H */
#define CY_CONTROL_REG_DriverControlReg_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} DriverControlReg_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    DriverControlReg_Write(uint8 control) ;
uint8   DriverControlReg_Read(void) ;

void DriverControlReg_SaveConfig(void) ;
void DriverControlReg_RestoreConfig(void) ;
void DriverControlReg_Sleep(void) ; 
void DriverControlReg_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define DriverControlReg_Control        (* (reg8 *) DriverControlReg_Sync_ctrl_reg__CONTROL_REG )
#define DriverControlReg_Control_PTR    (  (reg8 *) DriverControlReg_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_DriverControlReg_H */


/* [] END OF FILE */
